package ProgrammingWithClasses.Task8;

//8. Создать класс Customer, спецификация которого приведена ниже.
// Определить конструкторы, set- и get- методы и метод  toString().
// Создать второй класс, агрегирующий массив типа Customer, с подходящими конструкторами и методами.
// Задать критерии выбора данных и вывести эти данные на консоль.
//
// Класс Customer: id, фамилия, имя, отчество, адрес, номер кредитной карточки,
// номер банковского счета.  Найти и вывести:
// a) список покупателей в алфавитном порядке;
// b) список покупателей, у которых номер кредитной карточки находится в заданном интервале.

public class Main
{
    public static void main(String[] args)
    {
        Methods methods = new Methods();

        methods.customer[0] = new Customer(1199,"Сидоров","Виктор","вИКТОРОВИЧ","Столетова 8","123456789",125790);
        methods.customer[1] = new Customer(1233,"Лазарев","Илья","Петрович","Гамарника 5","100000000",125782);
        methods.customer[2] = new Customer(1222,"Ларионов","Фёдор","Ярославович","Янковского 5","789456321456",125783);
        methods.customer[3] = new Customer(1220,"Петров","Кирилл","Фёдорович","Гришковца 7","789654123465",125789);
        methods.customer[4] = new Customer(1234,"Емельянов","Олег","Игоревич","Гвиршиани 4","456789456123",125896);

        methods.sortBySurname();

        methods.listOfBuersInTheRange();

    }
}
